
#include "main.h"

//-----------------------------------------------------------------------//
/*
	PORTD |= (1<<(PORTD4));		// Передача
	PORTD &= ~(1<<(PORTD4));	// Прием
*/
//-----------------------------------------------------------------------//
int main(void)
{
	DDRD = 0xFF;				// порты на выход
	PORTD |= (1<<(PORTD4));		// Передача
	USARTinit(); //207 -> 9600 для 16Mhz 51 -> 19600 для 16Mhz
	sei();
	while (1)
	{
		PORTD |= (1<<(PORTD4));		// Передача
		_delay_ms(1);
		printf("test*");			// Тут должен выбираться адрес слейва 
		_delay_ms(1);
		PORTD &= ~(1<<(PORTD4));	// Прием
		_delay_ms(1000);				// Вместо задержки цикл с таймером на 3 попытки
		
									// Дальнейшая обработка буфера
									
									// Вывод информации
									
		for (int i = 0;i<sizeof(buffer);i++) // очистка буфера
		{
			buffer[i]=0;
		}
		
	}
}
//-----------------------------------------------------------------------//



//-----------------------------------------------------------------------//