
#include "main.h"

uint8_t Slaveadd = 0x68;
uint8_t cmd[10] = {0x10,0x11,0x12,0x13,0x14,0x15,0x16,0x17,0x18};

//-----------------------------------------------------------------------//
/*
	PORTD |= (1<<(PORTD4));		// Передача
	PORTD &= ~(1<<(PORTD4));	// Прием
*/
//-----------------------------------------------------------------------//
int main(void)
{
	DDRD = 0xFF;				// порты на выход
	PORTD |= (1<<(PORTD4));		// Передача
	USARTinit(); //207 -> 9600 для 16Mhz 51 -> 19600 для 16Mhz
	sei();
	while (1)
	{
		PORTD |= (1<<(PORTD4));							// Передача
		_delay_ms(1);
		printf("%c%c*",Slaveadd,cmd[0]);				// Тут должен выбираться адрес слейва и команда
		_delay_ms(1);
		PORTD &= ~(1<<(PORTD4));						// Прием
		_delay_ms(1000);								// Вместо задержки цикл с таймером на 3 попытки
		
														// Дальнейшая обработка буфера
									
														// Вывод информации
									
		for (int i = 0;i<sizeof(buffer);i++) // очистка буфера
		{
			buffer[i]=0;
		}
		
	}
}
//-----------------------------------------------------------------------//



//-----------------------------------------------------------------------//